Revit 2027 API
BuiltInFailures.CurtainWallFailures.TypePanelsFronNonRectCellsUnlocked Property
 Loaded family curtain panels cannot be used in non-rectangular cells of the curtain host. Type-driven panels from non-rectangular cells were unlocked and left unchanged.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TypePanelsFronNonRectCellsUnlocked { get; }
Public Shared ReadOnly Property TypePanelsFronNonRectCellsUnlocked As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TypePanelsFronNonRectCellsUnlocked {
	FailureDefinitionId^ get ();
}
static member TypePanelsFronNonRectCellsUnlocked : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace